import sys
if len(sys.argv) > 1:
    f = open(sys.argv[1],"r")
else:
    f = ["time\t15\t2\t202\tห้องเรียนเทส"]
lis = [
        ['1', 'อาคารเรียนและบริการ', '20', [['101','102'],['201','202'],['301','302']], '../../assets/img/head.png'],
        ['2', 'อาคารปฏิบัติการวิศวกรรมไฟฟ้า', '100', [['101','102'],['201','202'],['301','302']], '../../assets/img/head.png'],
        ['3', 'ศูนย์คอมพิวเตอร์วิศวกรรม', '200', [['101','102'],['201','202'],['301','302']], '../../assets/img/head.png'],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        ['14', 'อาคารวิศวกรรมศาสตร์ 60 ปี (อาคารชูชาติ กำภู)','13',[],'../..//assets/img/eng/e14.png'],
        ['15', 'อาคารปฏิบัติการคณะวิศวกรรมศาสตร์ (วิศวกรรมคอมพิวเตอร์)', '9',[[],{}], '../../assets/img/eng/E15.png'],
        ]

for line in f:
    if "ประทับเวลา" in line:
        continue
    print(line)
    #15/10/2017, 1:29:04 15  2   203 ห้อง Lecture
    line = line.split('\t')
    print(line)
    lis[int(line[1]) - 1 ][3][int(line[2]) - 1][line[2]] = line[3]
